[
  {
    "title": "6 Reasons We Ignore Our Needs and How to Stop",
    "author": "Lori Deschene",
    "content": "<div><p style='font-weight: 400;'><strong>“If you feel that you are missing out on fulfillment and happiness, but cannot put your finger on why, perhaps there is something deeper going on. Believe it or not, anyone can develop an unconscious habit of self-deprivation. Usually, this habit begins in childhood.” ~Mike Bundrant</strong></p> <p style='font-weight: 400;'>For all my adolescence and over a decade of my adult life, I was what men (and I’m guessing some female friends as well) would refer to as “emotionally needy.” And some did. To my face. With a sense of condescension and judgment.</p> <p style='font-weight: 400;'>They were right. I was clingy, insecure, and fragile. I needed regular reassurance. And I was constantly on the lookout for signs that someone might reject or abandon me.</p> <p style='font-weight: 400;'>I was also highly dependent on external validation because I didn’t believe I was worthy or good enough. And I treated myself like I wasn’t.</p> <p style='font-weight: 400;'>I frequently deprived myself of the things that might make me feel happy and whole while numbing myself with other things that made me feel worse about myself and even more depleted.</p> <p style='font-weight: 400;'>Instead of expressing my feelings about things that had hurt me, I attempted to drown and burn my emotions with booze, cigarettes, and weed.</p> <p style='font-weight: 400;'>Instead of sharing myself authentically and pursuing relationships with people who seemed receptive and trustworthy, I shapeshifted and chased one emotionally unavailable person after another—repeating a humiliating pattern of rejection and neglect that felt painful yet familiar.</p> <p style='font-weight: 400;'>And then there were the many ways I ignored my physical needs. Like pushing myself to work more when I really needed a break—so I could achieve something big enough to feel I was worthy of love. Or forcing myself to exercise when I really needed to rest—so I wouldn’t <em>become</em> big enough to attract the same abuse I’d endured as a bullied kid.</p> <p style='font-weight: 400;'>I can’t remember exactly when it happened, but I eventually realized I was so needy because I didn’t value or <a href='https://tinybuddha.com/selfcare/'>honor my own needs</a>—so I looked to someone else to do it. It was the ultimate in disempowerment. I was a fragile shell of a human being who desperately hoped someone would fill me up, and convince me I deserved it.</p> <p style='font-weight: 400;'>But the irony is that when you don’t believe you deserve good things, you’re likely to sabotage or reject them when they come your way. If you even put yourself in the position to attain them.</p> <p style='font-weight: 400;'>And the truth is that no one else can be responsible for meeting all our needs. And most people who try (and inevitably fail) are dealing with their own wounds—fulfilling some kind of savior complex that resulted from childhood trauma. Another pattern I know all too well.</p> <p style='font-weight: 400;'><strong>If we want to feel happy, worthy, and loved, we have to take responsibility for meeting those needs for ourselves.</strong></p> <p style='font-weight: 400;'>That doesn’t mean we can’t also form relationships with people who see our worth. Just that we won’t depend on their perception to maintain our own. And we won’t require anything (or much) from them to fill our own cup. Because we’ll not only have the awareness and tools to do it ourselves but the confidence that we deserve it.</p> <p style='font-weight: 400;'>If you can relate to any of my story or even just some, there’s a good chance you also struggle with recognizing and honoring your needs. And this likely affects more than just your relationships.</p> <p style='font-weight: 400;'>It might manifest as deteriorating mental or physical health. It might result in professional burnout if you push yourself to do too much, especially within a toxic work culture. It could also lead to a sense of emptiness and purposelessness if you continually ignore the voice inside that tells you you’re unfulfilled.</p> <p style='font-weight: 400;'>The first step to changing all of that is to recognize that you’re devaluing and deprioritizing your needs and do some soul-searching to understand why.</p> <p style='font-weight: 400;'>When we understand the conditioning and beliefs that have shaped us, we’re able to work on the type of internal healing that can lead to major external change.</p> <p style='font-weight: 400;'>It was only when I healed my deepest core wounds that I was able to change my patterns because I was no longer building from a foundation built on trauma but rather one erected in its place from self-love. Self-love that started as the tiniest seed and eventually grew into a mighty tree—much like the one at the top of this site.</p> <p style='font-weight: 400;'>Not sure why you ignore your needs? Perhaps, like me, you’ve experienced some of the following.</p> <h3><strong>6 Reasons We Ignore Our Needs</strong></h3> <h4 style='font-weight: 400;'><strong> 1. </strong><strong>You grew up watching other people putting themselves last.</strong></h4> <p style='font-weight: 400;'>If your parents or caregivers constantly neglected themselves while trying to please other people, you might have learned from their example that it’s selfish or wrong to put yourself first.</p> <p style='font-weight: 400;'>They probably thought the same, and maybe for the same reason. Patterns of self-neglect, self-sabotage, and self-destruction often get passed on from generation to generation until someone says, “No more” and does the work to break the cycle.</p> <h4><strong>2. You learned, by how you were treated growing up, that your needs aren’t important, or as important as other people’s.</strong></h4> <p style='font-weight: 400;'>If your parents or caregivers ignored or neglected your needs, regularly or as a form of punishment, you might have concluded that you’re not worthy of having your needs met, or that you deserve to be deprived in some way whenever you make a mistake.</p> <p style='font-weight: 400;'>You likely didn’t realize as a kid that when your parents failed to show up as you needed them to, it was because <em>they </em>were wrong, not you.</p> <p style='font-weight: 400;'>This doesn’t mean they were bad people or even horrible parents. Once again, they were likely repeating what they experienced as kids because they didn’t know any better. (But now <em>you </em>do.)</p> <h4><strong>3. You believe that having needs is somehow wrong or a sign of weakness.</strong></h4> <p style='font-weight: 400;'>You might mistakenly assume that having needs is the same as being needy—perhaps because someone else ingrained this belief in you, directly or indirectly. Maybe by invalidating your feelings, gaslighting you when you spoke up for yourself, or shaming you for asking for help.</p> <p style='font-weight: 400;'>But as I realized, there’s a huge distinction between having needs and being needy. And more importantly, when you’re able to recognize and honor your own needs, you’re not dependent on other people to do it for you. <em>Which is the exact opposite of being needy</em>.</p> <h4><strong>4. You believe prioritizing yourself is unsafe because other people might hurt, judge, or abandon you. </strong></h4> <p style='font-weight: 400;'>If you were hurt, judged, and abandoned as a result of trying to honor your needs in the past, you might carry a subconscious fear that this could happen again. Consequently, you might feel panic even thinking about honoring your needs.</p> <p style='font-weight: 400;'>And if you’re anything like I used to be, you probably don’t realize you’re better off losing anyone you <em>could</em> lose by speaking up for your needs.</p> <h4><strong>5. You believe you need to earn good things and that you haven’t done enough to deserve them yet.</strong></h4> <p style='font-weight: 400;'>In our achievement-focused culture, it’s easy to conclude that you’re not good enough if you haven’t accomplished something impressive. If this is true for you, you might be putting most of your needs on hold until you achieve something that makes you feel worthy.</p> <p style='font-weight: 400;'>In my twenties I spent many days and nights glued to a computer, thinking everything would be better in my life if I could just find a way to make a mark—and some decent money in the process. It didn’t occur to me that I could feel better <em>right in that moment</em> by stepping away, taking care of my needs, and allowing myself to be present while doing something I enjoyed.</p> <h4><strong>6. You’re living in survival mode, and your needs aren’t even on your radar because you’re focused on getting through the day.</strong></h4> <p style='font-weight: 400;'>If you’re living in a state of chronic stress, due to trauma, grief, or burnout, you’re quite possibly doing the bare minimum, just trying to keep your head above water. When you’re in survival mode, you have no energy left to focus on your needs, big or small.</p> <p style='font-weight: 400;'>I experienced this when I was at my worst mentally and physically, struggling with depression and bulimia while also suppressing deep trauma. And I went through something similar (but far less life-threatening) as a chronically sleep-deprived new mother, without a village.</p> <p style='font-weight: 400;'>—</p> <p style='font-weight: 400;'>If you were nodding your head while reading any of the above, you now have a good starting point for changing your patterns.</p> <p style='font-weight: 400;'>The next step is to regularly check in with yourself and ask yourself two questions:</p> <ul> <li style='font-weight: 400;'>What do I need right now—physically, mentally, and/or emotionally—to feel and be my best?</li> <li style='font-weight: 400;'>What false beliefs do I need to challenge in order to meet that need?</li> </ul> <p style='font-weight: 400;'>The first question requires you to get really honest with yourself and to let go of the instinct to judge your needs. Because they might be different from other people’s.</p> <p style='font-weight: 400;'>You might need to share your feelings in a trusting space while someone else might not require the same type of emotional support in a similar situation.</p> <p style='font-weight: 400;'>You might need to get up and move your body while someone else might be able to continue with the task at hand for longer.</p> <p style='font-weight: 400;'>You might need time to yourself to recharge while someone else might be fine and even content with socializing for longer.</p> <p style='font-weight: 400;'>The important thing to remember is you’re not them, and that’s not only okay but beautiful! Because honoring your unique needs allows you to show up as the best version of your unique self.</p> <p style='font-weight: 400;'>As for the second question, when you pause and really think about why you might choose to deprive yourself, you give yourself the opportunity to challenge your instinctive behavior and overcome your conditioning.</p> <p style='font-weight: 400;'>I’ve found that a tiny pause can be huge.</p> <p style='font-weight: 400;'>In tiny pauses, I’ve realized I need to let myself cry instead of stuffing my painful feelings down, burying all hopes of joy with them. That this isn’t wrong or a sign of weakness but rather a precursor to feeling stronger.</p> <p style='font-weight: 400;'>In tiny pauses, I’ve recognized that I need to get outside instead of isolating myself or forcing myself to be productive. That I don’t need to accomplish anything to be worthy of relief and connection.</p> <p style='font-weight: 400;'>And in pauses somewhat longer, I’ve found the strength to speak up when someone mistreats or devalues me. Because I remember that, contrary to what I concluded when I was younger, I am worthy of love and respect.</p> <p style='font-weight: 400;'>Knowing this is the key to honoring our needs. Because honoring our needs is the number one way we give these things to ourselves.</p> </div>",
    "category": "change"
  },
  {
    "title": "When Something Has to Change: How to Push Yourself to Take Action",
    "author": "Megan Forrest",
    "content": "<div><p><strong>“The truth you believe in and cling to makes you unavailable to hear anything new.” ~Pema Chodron</strong></p> <p>At some point, there comes a defining moment when you know beyond a shadow of a doubt that you just can’t keep living the way you’ve been living.</p> <p>You know that something has got to give and realize that you only have two options—either change or stay the same.</p> <p>The idea of having to choose either one of those options feels absolutely unbearable, so you find yourself trapped between the two, in this awful purgatory of indecision.</p> <p>That’s exactly where I was trapped: unable to stay in an unhappy marriage, and unable to leave it.</p> <p>The prospect of changing required the long journey inward, having to look at myself honestly and courageously and do the things I was afraid to do.</p> <p><strong>To change meant that I had to leap into uncharted waters, not knowing if I’d sink or swim. And in the face of that, I was easily lured back to the comfort of the familiar.</strong></p> <p>I was quick to reassure myself that even in my unhappy situation, with all of its heartache and suffering, at least I knew what to expect. And that thought was comforting.</p> <p>In precise tandem with that thought was the awareness that if I couldn’t bring myself to leap off the cliff to change, I would be stuck living life in this state of unhappiness and dysfunction. And that thought was terrifying.</p> <p>I couldn’t stay where I was, but I was too afraid to move forward.</p> <p>This purgatory of indecision was an awful place to be. It was filled with its own unique despair. It was fraught with doubt, shame, anger, and huge amounts of fear. But in spite of that, it still wasn’t enough to propel me in any one direction.</p> <p>I was stuck in this purgatory for years. Eventually, I came to understand that my thoughts and beliefs didn’t actually come from me. They came from the very loud and dictatorial voice of my codependent mind.</p> <p>It had become so loud and powerful that it had all but drowned out my own voice. One of its most potent functions was to convince me that every terrible thing I told myself about myself was the gospel truth.</p> <p>I’ve learned to think of my codependency as a seed—and the same analogy applies for addiction, depression, and other struggles.</p> <p>There sits the seed of it, buried deep in our brain. And in some of us, at some point, something will happen to trigger it.</p> <p>That event acts as the water it needs to grow. If it’s allowed to set its roots down, it continues to grow stronger and stronger. The voice of that dysfunction slowly and steadfastly takes over and begins to drown out you.</p> <p><strong>Eventually, this dysfunctional voice is the only one you hear, and so you recognize it as you, but it’s not.</strong></p> <p>I think of it as two minds—my mind and the codependent mind. My co-dependent mind had grown so big, and its roots so deep, that it was calling all the shots.</p> <p>The mind of any dysfunction, regardless of where it originated, has its own unique sets of toolboxes. In my case, my codependent mind was a master at using fear and self-doubt to create confusion.</p> <p>Fear, along with self-doubt, whispers “you’re not good enough” or “you are not worthy,” and insists, “you can’t trust what you feel or what you think,” thereby creating all kinds of space for confusion to reign.</p> <p>There was a constant tug of war going on inside of me. I was convinced that what I wanted and needed was wrong if it wasn’t in alignment with what others wanted and needed from me.</p> <p>Daily, my codependent mind reminded me that I was inadequate, unlovable, unworthy, and incapable. And as the codependent voice got louder and louder, it eventually became the only voice I recognized and heard.</p> <p><strong>But here’s the thing: The secret to silencing that voice of dysfunction is to challenge it. We must disbelieve what it’s saying.</strong></p> <p>The problem was that any attempt at disagreeing with what my codependent mind created huge amounts of anxiety and fear.</p> <p>So you can see the predicament: To silence it, we have to disbelieve it. And to disbelieve it creates tremendous anxiety.</p> <p>The thing you need to know is that anxiety is the superpower of any dysfunction. It uses our disdain and discomfort for feeling anxious as a way of staying in control. This is what makes it so clever and difficult to outwit.</p> <p>And it was this desperate need to avoid feeling anxious that kept me from challenging my codependent thinking.</p> <p>As tough as it may seem, to be able to change your beliefs about yourself, you need to disbelieve what that voice of dysfunction is telling you, and do the very thing you think you can’t do.</p> <p>As you challenge it, you will experience anxiety and fear. But no one has ever died from feeling anxious or afraid. Ever.</p> <p><strong>Feeling anxious or afraid will not kill you. But it will free you from the life you are trapped in, and from the incessant voice of your dysfunctional mind.</strong></p> <p>I began by deciding to actively disbelieve any negative or unkind thoughts I had about myself.</p> <p>If they didn’t lift me up, I disbelieved them. Martha Beck, author and monthly columnist for <em>O, The Oprah Magazine </em>says: “All thoughts that separate you from genuine happiness are lies.” That became my daily mantra.</p> <p>As I practiced this new way of being—refusing to believe those negative thoughts as gospel truth—slowly but surely, my thoughts and beliefs about myself began to change.</p> <p>When my codependent thinking said I wasn’t capable, I chose to trust my capabilities were enough for that moment. When my codependent thinking said I wasn’t good enough, I chose to believe that I was enough.</p> <p>The more I decided I was lovable and worthy of love, the more confident, assured, and certain I became of who I was, and the more clearly I could hear my own voice.</p> <p>You must decide that you will no longer trust the voice of dysfunction. And once you do, I promise you, it will begin to retreat, and your voice—the voice of self-love, truth, and wisdom—will become loud and clear.</p> <p><em><a href='http://www.shutterstock.com/pic-232300015/stock-photo-stress.html?src=BP11iNAZXWLat98qY34vjg-12-37' target='_blank' rel='noopener noreferrer'>Stressed image</a> via Shutterstock</em></p></div>",
    "category": "change"
  },
  {
    "title": "Trying to Change Your Life? 6 Reminders to Help You Keep Going",
    "author": "Ana Batista",
    "content": "<div> <p><strong>“You can’t change what’s going on around you until you start changing what’s going on within you.” ~Zig Ziglar</strong></p> <p>When you’re studying for eighteen years to have a chance at a better future, you’re not <a href='https://tinybuddha.com/hub/letting-go/expectations/'>expecting</a> to end up wearing yellow gloves and washing dishes, right? But what if I tell you that it made me happier than a job sitting behind a desk at a renowned institution?</p> <p>You might be thinking now, “If this post is about how to change from a job behind a desk to one behind a sink, I better not waste my time reading it.” But no, it isn’t.</p> <p>This post is about the attitude that helped me to overcome a situation that was eating up my soul and create a life that makes me excited about the future.</p> <p>We’ve all experienced <a href='https://tinybuddha.com/hub/change-challenges/change-life-deal/'>different kinds of change in life</a>: changes that you don’t want to face, changes that you’re forced to accept, and changes that you can’t wait to see happening but that seem to be impossible, leaving you feeling stuck with what you have.</p> <p>After I got my master’s degree in psychology and spent months without a clue about what I was going to do with it, I finally got a job in a pharmaceutical company, working as a psychologist for patients on a clinical trial.</p> <p>It felt like I had won the lottery. I had my office and my desk; the company paid for trips around the world and gave us an unlimited supply of coffee and soda. The old-fashioned side of my mind thought, “This is it. I just got myself a job for life.” Yeah, sure.</p> <p><strong>After one year there, thinking I had finally become a grownup a with a real job despite my internship-like earnings, I asked for raise and got fired for that reason, two weeks before Christmas. </strong></p> <p>At that time, I had no <a href='http://tinybuddha.com/blog/30-simple-mindfulness-practices-to-help-you-focus-and-be-present/'>practice in mindfulness</a> and had never meditated, so my boat would rock hard with any little storm. I cried, and it wasn’t pretty.</p> <p>How was I going to pay the bills? How was I going to manage to continue living in that beautiful little duplex downtown?</p> <p>Well, it turns out, just like most of the things that happen in life, this was also a blessing in disguise.</p> <p>Being fired forced me to let go of a life that I was getting used to, even if it was far from my ideals of living in harmony with nature, with time and the freedom to be more creative. It was a wake-up call that forced me to find another path, one more aligned with my values that would lead to a future I could rely on myself to build.</p> <p>I decided then that I didn’t want to put my future in others’ hands and wait for their recognition or approval to progress in life.</p> <p>Of course, I had moments of <a href='http://tinybuddha.com/blog/accepting-uncertainty-can-happy-without-answers/'>uncertainty</a> and a little despair when I was forced to change, and had no idea what I was going to do. I knew that sitting behind a desk again wasn’t going to be the best option, or else I wouldn’t be searching for alternative jobs and alternative lifestyles on every single break I had on that job.</p> <p><strong>So how did I move on? Well, first by doing nothing. <em>What?</em> I hear you ask. That’s right. I took the time just to do the things I loved to do, explored more about what they were, and allowed myself to take a break from the “must be doing something” mindset.</strong></p> <p>Then, when the opportunity appeared and the moment felt right, I moved to Sweden—a place where I had been happy before—to experiment starting a new life.</p> <p>I got a second master’s degree while being a waiter, living in tiny rooms, and taking many skinny dips in beautiful and extraordinarily cold lakes.</p> <p>Then I got the courage to travel to India by myself, where I took yoga and meditation courses.</p> <p>I did all this with a purpose in mind: to own the creation of my life.</p> <p><strong>So even when I was washing other people’s plates with yellow rubber gloves on, I felt happy. It all had meaning; I was pursuing my dreams.</strong></p> <p>The result? Now, I finally am my own boss and have full ownership and responsibility for my future. And I get to live in a house with a sea view, in harmony with nature, as I dreamed.All it took was the right mindset, along with calm, courage, willingness, and persistence.</p> <p>If you’re going through some imposed change or you’re looking forward to seeing one, it may help to remember these six thoughts that helped me make that transition and create lasting transformation:</p> <h4>1. Don’t panic: this too shall pass.</h4> <p>Just because there’s something you desperately want or need to change, that doesn’t mean you need to go into urgency mode, trying to do all at once. <a href='http://tinybuddha.com/blog/simple-way-calm-feeling-strong-emotions/'>Keep yourself calm</a> and relaxed so that you can make the right choices, not choices urged by worry and stress.</p> <p>Change is inevitable; you don’t need to rush it. Just keep yourself open to receiving what life brings you and try to make the best out of it.</p> <h4>2. Being still is much better than moving in the wrong direction.</h4> <p>When you <a href='http://tinybuddha.com/blog/instantly-calm-stressful-situations/'>calm down</a> and give yourself time for self-discovery and improvement, the next right step will become much clearer.</p> <p>If you don’t, you’ll end up getting yourself in some situation that seems different but, at its core, is the same. You’ll just be wasting your precious time—that time that you so want to use wisely and not spend on wrong life decisions.</p> <h4>3. Change doesn’t happen in a day, it happens with every little habit.</h4> <p>Sure, there are times when life calls for dramatic changes, such as leaving a job, moving to a different country, or ending a long-term relationship. But the biggest changes are the ones that we cultivate day in and day out.</p> <p>Every time we decide to work out and eat a healthier meal, every time we choose a positive thought over a negative, and every time that we do something we love, even if that scares us, we are shaping the course of our life.</p> <h4>4. Our life is a reflection of our mind; energy flows where attention goes.</h4> <p>Every day we have an opportunity to make change happen. No matter what situation we’re in, it’s our choice and our responsibility.</p> <p>The state of our life is not our parents’ fault, nor the economy, nor luck. The choice and the responsibility for our life and our success are ours, and it starts with what we focus on, how we perceive things, and how that perception influences how we decide to act.</p> <p>If we focus on our fears and worries, our actions will reflect that, and we’ll find more to fear and worry about. If we focus on hope and possibilities, our actions will reflect that, and we’ll find more to be excited and hopeful about.</p> <h4>5. Change means progress, and progress means happiness.</h4> <p>Life is, in essence, change. Trying to fight it is like trying to stop the seasons.</p> <p>Nature is in constant transformation, and so are we, and so is our life.</p> <p>If we embrace change as something natural, we can start to cultivate it positively, just as one waters a seed to make it thrive and grow into a fruitful tree.</p> <p>When we accept living a progressive, ever-changing life, we feel more alive, purposeful, and proud of ourselves. We see more meaning in the experience of living.</p> <h4>6. Sometimes, what seems to be a step back can be a huge step forward.</h4> <p>Many times, what holds us back from going after our dreams is the attachment we feel to what we already have or a stiff idea of how things should and shouldn’t be.</p> <p>One shouldn’t be washing dishes with two master degrees, right?</p> <p>But it’s the ability to be open and flexible to life circumstances that dictates how much progress, success, and happiness one is able to experience.</p> <p>Sometimes, we need to take a step back if we want to move forward.</p> <p>Change might not always be easy, but it’s what leads us to different experiences and lessons in life. Isn’t that what life is all about? A journey of evolution and learning?</p> </div>",
    "category": "change"
  }
]
