[
  {
    "title": "When You Want to Make a Change but Feel Confused and Scared",
    "author": "Amanda Christian",
    "description": "“Once you make a decision, the universe conspires to make it happen.” ~Ralph Waldo Emerson",
    "content": "<div><p>Have you ever had an inner knowing that it was time to make some life changes, but you felt too confused to make them?</p> <p>I’ve certainly felt that way a time or two. After I graduated college years ago, I felt <a title='How to Find Clarity When You're Confused About What to Do' href='http://tinybuddha.com/blog/how-to-find-clarity-when-youre-confused-about-what-to-do/'>completely confused about what I was going to do</a> with my life. I was asking myself questions like: How am I going to find meaning? What should I do for a career? How can I make my dreams a reality?</p> <p>But what if you feel so confused about your life that you end up doing nothing?</p> <p>I remember moving home after college, lying in bed and reading fiction books for hours. I wanted to escape from the intense confusion and endless questions running through my mind.</p> <p>The reality is, I was scared. I was scared to start a job, but also scared not to. I was scared to move away from the comforts of home, but deep down I couldn’t wait to get out. I was <a title='5 Ways to Let Go and Embrace an Uncertain Future' href='http://tinybuddha.com/blog/5-ways-to-let-go-and-embrace-an-uncertain-future/'>scared of the unknown</a>, but also excited by the fact that anything could happen!</p> <p>I was afraid to make a change, so I tricked myself into thinking that it was too complicated and confusing. For a couple months I did nothing, and my frustration grew.</p> <p><strong>Fear-based confusion is when you have an inner knowing that things are “off,” or you want to make a major life change, but you feel too confused to take action.</strong></p> <p>It seems like there are too many problems, unknowns, reasons why-not, or decisions that are too difficult to make. So you stay confused.</p> <p>Does this sound familiar? Maybe you’re confused about making a career change, moving to a new city, ending a relationship, or getting your finances in order. I think we’ve all experienced this fear-gripping confusion in one form or another, and I know how frustrating it can feel.</p> <p>I’ve noticed that when you’re aware we’re confused because we’re scared, it can drastically reduce your stress about it.</p> <p>You’re certainly not alone or helpless. And luckily, fear-based confusion is easy to move beyond. Below are my top ways to move through life confusion and finally get clear on what you want so you can take action toward it.</p> <h4>1. Follow your excitement.</h4> <p>If the fear runs deep, following your excitement will help. For example, instead of trying to answer the question, “What should I do with my life?” ask yourself, “What excites me right now?”</p> <p>Make a list of all the activities and experiences that excite you, but try not to judge your list. For example, simply riding my bike to a local cafe for some homemade chai in the morning really excites me. It doesn’t matter if things on your list seem small or insignificant.</p> <p>There are several benefits to following what excites you in this moment. One, you start to feel more excited about your life. And two, your excitement usually leads you to people and experiences that will help you set a direction for yourself (more on this below).</p> <p>Follow what excites you <em>now</em>, and know that your sources of excitement are going to shift and change as you grow.</p> <p>Following your excitement is much less daunting than trying to figure out your whole life. In addition, it leaves room for expansion and gives you the freedom to continually try new things.</p> <h4>2. Decide on your direction.</h4> <p>Decide very clearly on the direction you want to go in. Making a clear decision is the quickest way out of confusion. I know this sounds obvious, but sometimes we have insane inner thoughts that hold us back. Thoughts like, “<a title='7 Things to Remember When You Think You're Not Good Enough' href='http://tinybuddha.com/blog/7-things-to-remember-when-you-think-youre-not-good-enough/'>I’m not good enough</a>” or “I don’t deserve this.”</p> <p>But you most definitely are good enough, and you do deserve peace no matter what you’re telling yourself. Believe in yourself enough to make a decision and know that you <em>will</em> make the right one. Don’t worry about making a “bad” decision. In my opinion, making no decision at all is often worse.</p> <p>In my example above, after a couple of months living with my parents and sinking deeper into my confusion, I decided to pack a backpack and travel to Spain. I didn’t really have any idea how that was going to help me answer my “big” life questions, but it excited me.</p> <p>When I got back home from that trip, I <a title='8 Ways to Be More Confident: Life the Life of Your Dreams' href='http://tinybuddha.com/blog/8-ways-to-be-more-confident-live-the-life-of-your-dreams/'>felt confident</a> and even more excited. I then made the concrete decision to move across the country to Northern California, and that completely changed everything for me.</p> <p>The point is, it didn’t really matter <em>what</em> I did. It was my initial decision to do <em>something</em> that got me out of my confusion.</p> <p>Once you make the initial decision, the Universe will start to provide you with people and experiences that help you move forward. Breathe, become aware of how your decision <em>feels</em> in your body, and act on whatever option has a sense of lightness and openness to it.</p> <h4>3. Release your expectations.</h4> <p><a title='Are Your Expectations Setting You Up for Disappointment?' href='http://tinybuddha.com/blog/are-your-expectations-setting-you-up-for-disappointment/'>Expectations lead to disappointment</a>. Usually, when we finally make the decision to change, we proceed to come up with a detailed plan for how it should all go down. We immediately search for something that will make us feel secure in the face of change.</p> <p>But the truth is, you can manifest change much more quickly when you open yourself up the all the possibilities that you haven’t even thought of yet.</p> <p>It’s perfectly okay to focus on what you want, but I like to try and leave the details to the Universe and simply focus on what I’m excited and capable of doing right now. This allows you to feel joy <em>now</em> instead of making your joy dependant on a certain outcome in the future.</p> <p>You are meant to be here. As you focus on following what excites you in this moment, the clouds of confusion begin to part and you can see your direction more clearly. Then, moving toward it with inner confidence becomes natural.</p> <p>It’s okay to feel vulnerable in the process, but I know from experience that the vulnerability associated with change is completely worth it. <em>You’re </em>worth it. Don’t let the confusion hold you back a moment longer. Once you take the first step, everything else will unfold for you.</p></div>",
    "category": "change",
    "createdBy": "662dfec99e0566e4e22e9ad7"
  },
  {
    "title": "When Something Has to Change: How to Push Yourself to Take Action",
    "author": "Megan Forrest",
    "description": "“The truth you believe in and cling to makes you unavailable to hear anything new.” ~Pema Chodron",
    "content": "<div><p>At some point, there comes a defining moment when you know beyond a shadow of a doubt that you just can’t keep living the way you’ve been living.</p> <p>You know that something has got to give and realize that you only have two options—either change or stay the same.</p> <p>The idea of having to choose either one of those options feels absolutely unbearable, so you find yourself trapped between the two, in this awful purgatory of indecision.</p> <p>That’s exactly where I was trapped: unable to stay in an unhappy marriage, and unable to leave it.</p> <p>The prospect of changing required the long journey inward, having to look at myself honestly and courageously and do the things I was afraid to do.</p> <p><strong>To change meant that I had to leap into uncharted waters, not knowing if I’d sink or swim. And in the face of that, I was easily lured back to the comfort of the familiar.</strong></p> <p>I was quick to reassure myself that even in my unhappy situation, with all of its heartache and suffering, at least I knew what to expect. And that thought was comforting.</p> <p>In precise tandem with that thought was the awareness that if I couldn’t bring myself to leap off the cliff to change, I would be stuck living life in this state of unhappiness and dysfunction. And that thought was terrifying.</p> <p>I couldn’t stay where I was, but I was too afraid to move forward.</p> <p>This purgatory of indecision was an awful place to be. It was filled with its own unique despair. It was fraught with doubt, shame, anger, and huge amounts of fear. But in spite of that, it still wasn’t enough to propel me in any one direction.</p> <p>I was stuck in this purgatory for years. Eventually, I came to understand that my thoughts and beliefs didn’t actually come from me. They came from the very loud and dictatorial voice of my codependent mind.</p> <p>It had become so loud and powerful that it had all but drowned out my own voice. One of its most potent functions was to convince me that every terrible thing I told myself about myself was the gospel truth.</p> <p>I’ve learned to think of my codependency as a seed—and the same analogy applies for addiction, depression, and other struggles.</p> <p>There sits the seed of it, buried deep in our brain. And in some of us, at some point, something will happen to trigger it.</p> <p>That event acts as the water it needs to grow. If it’s allowed to set its roots down, it continues to grow stronger and stronger. The voice of that dysfunction slowly and steadfastly takes over and begins to drown out you.</p> <p><strong>Eventually, this dysfunctional voice is the only one you hear, and so you recognize it as you, but it’s not.</strong></p> <p>I think of it as two minds—my mind and the codependent mind. My co-dependent mind had grown so big, and its roots so deep, that it was calling all the shots.</p> <p>The mind of any dysfunction, regardless of where it originated, has its own unique sets of toolboxes. In my case, my codependent mind was a master at using fear and self-doubt to create confusion.</p> <p>Fear, along with self-doubt, whispers “you’re not good enough” or “you are not worthy,” and insists, “you can’t trust what you feel or what you think,” thereby creating all kinds of space for confusion to reign.</p> <p>There was a constant tug of war going on inside of me. I was convinced that what I wanted and needed was wrong if it wasn’t in alignment with what others wanted and needed from me.</p> <p>Daily, my codependent mind reminded me that I was inadequate, unlovable, unworthy, and incapable. And as the codependent voice got louder and louder, it eventually became the only voice I recognized and heard.</p> <p><strong>But here’s the thing: The secret to silencing that voice of dysfunction is to challenge it. We must disbelieve what it’s saying.</strong></p> <p>The problem was that any attempt at disagreeing with what my codependent mind created huge amounts of anxiety and fear.</p> <p>So you can see the predicament: To silence it, we have to disbelieve it. And to disbelieve it creates tremendous anxiety.</p> <p>The thing you need to know is that anxiety is the superpower of any dysfunction. It uses our disdain and discomfort for feeling anxious as a way of staying in control. This is what makes it so clever and difficult to outwit.</p> <p>And it was this desperate need to avoid feeling anxious that kept me from challenging my codependent thinking.</p> <p>As tough as it may seem, to be able to change your beliefs about yourself, you need to disbelieve what that voice of dysfunction is telling you, and do the very thing you think you can’t do.</p> <p>As you challenge it, you will experience anxiety and fear. But no one has ever died from feeling anxious or afraid. Ever.</p> <p><strong>Feeling anxious or afraid will not kill you. But it will free you from the life you are trapped in, and from the incessant voice of your dysfunctional mind.</strong></p> <p>I began by deciding to actively disbelieve any negative or unkind thoughts I had about myself.</p> <p>If they didn’t lift me up, I disbelieved them. Martha Beck, author and monthly columnist for <em>O, The Oprah Magazine </em>says: “All thoughts that separate you from genuine happiness are lies.” That became my daily mantra.</p> <p>As I practiced this new way of being—refusing to believe those negative thoughts as gospel truth—slowly but surely, my thoughts and beliefs about myself began to change.</p> <p>When my codependent thinking said I wasn’t capable, I chose to trust my capabilities were enough for that moment. When my codependent thinking said I wasn’t good enough, I chose to believe that I was enough.</p> <p>The more I decided I was lovable and worthy of love, the more confident, assured, and certain I became of who I was, and the more clearly I could hear my own voice.</p> <p>You must decide that you will no longer trust the voice of dysfunction. And once you do, I promise you, it will begin to retreat, and your voice—the voice of self-love, truth, and wisdom—will become loud and clear.</p> <p><em><a href='http://www.shutterstock.com/pic-232300015/stock-photo-stress.html?src=BP11iNAZXWLat98qY34vjg-12-37' target='_blank' rel='noopener noreferrer'>Stressed image</a> via Shutterstock</em></p></div>",
    "category": "change",
    "createdBy": "662dfec99e0566e4e22e9ad7"
  },
  {
    "title": "Trying to Change Your Life? 6 Reminders to Help You Keep Going",
    "author": "Ana Batista",
    "description": "“I’m stronger because of the hard times, wiser because of my mistakes, and happier because I have known sadness.” ~Unknown",
    "content": "<div><p>When you’re studying for eighteen years to have a chance at a better future, you’re not <a href='https://tinybuddha.com/hub/letting-go/expectations/'>expecting</a> to end up wearing yellow gloves and washing dishes, right? But what if I tell you that it made me happier than a job sitting behind a desk at a renowned institution?</p> <p>You might be thinking now, “If this post is about how to change from a job behind a desk to one behind a sink, I better not waste my time reading it.” But no, it isn’t.</p> <p>This post is about the attitude that helped me to overcome a situation that was eating up my soul and create a life that makes me excited about the future.</p> <p>We’ve all experienced <a href='https://tinybuddha.com/hub/change-challenges/change-life-deal/'>different kinds of change in life</a>: changes that you don’t want to face, changes that you’re forced to accept, and changes that you can’t wait to see happening but that seem to be impossible, leaving you feeling stuck with what you have.</p> <p>After I got my master’s degree in psychology and spent months without a clue about what I was going to do with it, I finally got a job in a pharmaceutical company, working as a psychologist for patients on a clinical trial.</p> <p>It felt like I had won the lottery. I had my office and my desk; the company paid for trips around the world and gave us an unlimited supply of coffee and soda. The old-fashioned side of my mind thought, “This is it. I just got myself a job for life.” Yeah, sure.</p> <p><strong>After one year there, thinking I had finally become a grownup a with a real job despite my internship-like earnings, I asked for raise and got fired for that reason, two weeks before Christmas. </strong></p> <p>At that time, I had no <a href='http://tinybuddha.com/blog/30-simple-mindfulness-practices-to-help-you-focus-and-be-present/'>practice in mindfulness</a> and had never meditated, so my boat would rock hard with any little storm. I cried, and it wasn’t pretty.</p> <p>How was I going to pay the bills? How was I going to manage to continue living in that beautiful little duplex downtown?</p> <p>Well, it turns out, just like most of the things that happen in life, this was also a blessing in disguise.</p> <p>Being fired forced me to let go of a life that I was getting used to, even if it was far from my ideals of living in harmony with nature, with time and the freedom to be more creative. It was a wake-up call that forced me to find another path, one more aligned with my values that would lead to a future I could rely on myself to build.</p> <p>I decided then that I didn’t want to put my future in others’ hands and wait for their recognition or approval to progress in life.</p> <p>Of course, I had moments of <a href='http://tinybuddha.com/blog/accepting-uncertainty-can-happy-without-answers/'>uncertainty</a> and a little despair when I was forced to change, and had no idea what I was going to do. I knew that sitting behind a desk again wasn’t going to be the best option, or else I wouldn’t be searching for alternative jobs and alternative lifestyles on every single break I had on that job.</p> <p><strong>So how did I move on? Well, first by doing nothing. <em>What?</em> I hear you ask. That’s right. I took the time just to do the things I loved to do, explored more about what they were, and allowed myself to take a break from the “must be doing something” mindset.</strong></p> <p>Then, when the opportunity appeared and the moment felt right, I moved to Sweden—a place where I had been happy before—to experiment starting a new life.</p> <p>I got a second master’s degree while being a waiter, living in tiny rooms, and taking many skinny dips in beautiful and extraordinarily cold lakes.</p> <p>Then I got the courage to travel to India by myself, where I took yoga and meditation courses.</p> <p>I did all this with a purpose in mind: to own the creation of my life.</p> <p><strong>So even when I was washing other people’s plates with yellow rubber gloves on, I felt happy. It all had meaning; I was pursuing my dreams.</strong></p> <p>The result? Now, I finally am my own boss and have full ownership and responsibility for my future. And I get to live in a house with a sea view, in harmony with nature, as I dreamed.All it took was the right mindset, along with calm, courage, willingness, and persistence.</p> <p>If you’re going through some imposed change or you’re looking forward to seeing one, it may help to remember these six thoughts that helped me make that transition and create lasting transformation:</p> <h4>1. Don’t panic: this too shall pass.</h4> <p>Just because there’s something you desperately want or need to change, that doesn’t mean you need to go into urgency mode, trying to do all at once. <a href='http://tinybuddha.com/blog/simple-way-calm-feeling-strong-emotions/'>Keep yourself calm</a> and relaxed so that you can make the right choices, not choices urged by worry and stress.</p> <p>Change is inevitable; you don’t need to rush it. Just keep yourself open to receiving what life brings you and try to make the best out of it.</p> <h4>2. Being still is much better than moving in the wrong direction.</h4> <p>When you <a href='http://tinybuddha.com/blog/instantly-calm-stressful-situations/'>calm down</a> and give yourself time for self-discovery and improvement, the next right step will become much clearer.</p> <p>If you don’t, you’ll end up getting yourself in some situation that seems different but, at its core, is the same. You’ll just be wasting your precious time—that time that you so want to use wisely and not spend on wrong life decisions.</p> <h4>3. Change doesn’t happen in a day, it happens with every little habit.</h4> <p>Sure, there are times when life calls for dramatic changes, such as leaving a job, moving to a different country, or ending a long-term relationship. But the biggest changes are the ones that we cultivate day in and day out.</p> <p>Every time we decide to work out and eat a healthier meal, every time we choose a positive thought over a negative, and every time that we do something we love, even if that scares us, we are shaping the course of our life.</p> <h4>4. Our life is a reflection of our mind; energy flows where attention goes.</h4> <p>Every day we have an opportunity to make change happen. No matter what situation we’re in, it’s our choice and our responsibility.</p> <p>The state of our life is not our parents’ fault, nor the economy, nor luck. The choice and the responsibility for our life and our success are ours, and it starts with what we focus on, how we perceive things, and how that perception influences how we decide to act.</p> <p>If we focus on our fears and worries, our actions will reflect that, and we’ll find more to fear and worry about. If we focus on hope and possibilities, our actions will reflect that, and we’ll find more to be excited and hopeful about.</p> <h4>5. Change means progress, and progress means happiness.</h4> <p>Life is, in essence, change. Trying to fight it is like trying to stop the seasons.</p> <p>Nature is in constant transformation, and so are we, and so is our life.</p> <p>If we embrace change as something natural, we can start to cultivate it positively, just as one waters a seed to make it thrive and grow into a fruitful tree.</p> <p>When we accept living a progressive, ever-changing life, we feel more alive, purposeful, and proud of ourselves. We see more meaning in the experience of living.</p> <h4>6. Sometimes, what seems to be a step back can be a huge step forward.</h4> <p>Many times, what holds us back from going after our dreams is the attachment we feel to what we already have or a stiff idea of how things should and shouldn’t be.</p> <p>One shouldn’t be washing dishes with two master degrees, right?</p> <p>But it’s the ability to be open and flexible to life circumstances that dictates how much progress, success, and happiness one is able to experience.</p> <p>Sometimes, we need to take a step back if we want to move forward.</p> <p>Change might not always be easy, but it’s what leads us to different experiences and lessons in life. Isn’t that what life is all about? A journey of evolution and learning?</p></div>",
    "category": "change",
    "createdBy": "662dfec99e0566e4e22e9ad7"
  },
  {
    "title": "7 Habits That Keep You Strong (Even When Things Go Wrong)",
    "author": "Linda Wattier",
    "description": "“You can’t change what’s going on around you until you start changing what’s going on within you.” ~Zig Ziglar",
    "content": "<div><p><strong>“I’m stronger because of the hard times, wiser because of my mistakes, and happier because I have known sadness.” ~Unknown</strong></p> <p>It’s happened to most of us.</p> <p>Despite our best intentions, something goes dreadfully wrong.</p> <p>You suffer a heartbreaking loss, make a terrible mistake, or get blindsided by an injury.</p> <p>In disbelief your mind cries, “Wait. What?”</p> <p>And then, “No, no, no, this can’t be happening.”</p> <p>After the initial shock, when the surge of stress hormones has subsided, you realize that yes, this <em>is</em> happening.</p> <p><strong>And you can’t help thinking: “But <em>how</em> could this happen? It’s not fair. I can’t bear it. Why me? Why now? How will I ever get through this?” </strong></p> <p>Your mind is reeling. You <a href='http://tinybuddha.com/blog/6-tips-release-anxiety-feel-calm-free/'>feel anxious</a> and dejected.</p> <p>Well, something like this just happened to me too.</p> <p>After eight days away and a grueling fifteen-hour return trip, my husband and I were relieved to finally arrive home at 1:00AM on a Wednesday.</p> <p>But as soon as I opened the front door, I knew something was terribly wrong. My beloved cat Tiffany had come to greet me, but she wasn’t purring in her usual comforting way.</p> <p>She was yowling in distress in a way I had never, ever heard before.</p> <p>“Wait. What? What’s wrong, what’s wrong?”</p> <p>And then somehow, I just knew. I ran further into the house and discovered evidence that confirmed one of my worst nightmares.</p> <p>My trustworthy, longtime pet sitter had not been in to care for Tiffany.</p> <p><strong>My sweet, sixteen-year-old cat had been home alone with no food, water, or heart medication for eight days. How was she even still alive?</strong></p> <p>As a devoted animal lover, witnessing Tiffany’s trauma and subsequent physical and mental decline has been heartbreaking for me.</p> <p>I’ve had plenty of negative, angry, and despairing thoughts vying for my attention over this. And I definitely felt weakened by the experience.</p> <p>But as soon as I could, I consciously returned to the habits I’ve created over time that keep me strong no matter what shows up in my life.</p> <h4>1. Use your power of choice.</h4> <p>No matter what your circumstances, <a href='http://tinybuddha.com/blog/we-have-the-power-to-choose/'>you have the power to choose</a> your direction and how to use your energy. You can choose to use your energy in positive, productive ways or in negative, destructive ways. Either way, the choices you make now determine your future.</p> <p>As soon as I opened my front door and saw Tiffany’s suffering, I had some choices to make. I could choose to stay devastated, distraught, and depressed. Or I could choose to embrace the miracle that my cat was still alive and empower myself to give her the loving attention she deserved.</p> <p>Practice choosing to focus your energy in positive directions until it becomes a habit. Once it does, you will be more empowered and experience less trouble in your life. You will feel like you are living on purpose, taking charge of your direction rather than viewing life as something that just happens to you.</p> <h4>2. Accept what is, no matter what.</h4> <p>Practice <a href='http://tinybuddha.com/blog/life-isnt-good-or-bad-it-just-is/'>not mentally labeling what happens as good or bad</a>; just let it be.</p> <p>Accepting what is, instead of judging it, puts you in a state of inner non-resistance. You can still want to change things, but you have a calmer attitude, and any action you take to improve your situation is more effective.</p> <p>I rated my Tiffany’s circumstances as terrible at first. But by quickly accepting the situation instead of raging against it, all my mental and intuitive energy was available to discern what she needed most so that I could help her right away.</p> <p>Allow things to be as they are rather than resisting them. Once this becomes a habit, you’ll find yourself calmly thinking of effective solutions for problems that used to be overwhelming.</p> <h4>3. Be grateful.</h4> <p>Besides enhancing your everyday life, finding <a href='http://tinybuddha.com/blog/life-isnt-good-or-bad-it-just-is/'>things to be grateful for</a> can help you cope during hard times by giving you a wider perspective that helps you feel less overwhelmed by difficult circumstances.</p> <p>An eight-pound, sixteen-year-old cat with a heart condition could easily have died from such a trauma. So I had three things to be grateful for that night.</p> <p>First, Tiffany was still alive. Second, I got home just in time to rescue her. And third, I was grateful that my pet sitter had taught me to leave extra water out when going on a trip. This is probably what saved Tiffany’s life.</p> <p>Practice focusing on what’s going right. Notice things to be grateful for every day. Soon, finding something to be grateful for will become your automatic response to anything that happens. And eventually you’ll find that your gratitude habit brings more joy into your life.</p> <h4>4. Neutralize the negative.</h4> <p>Sometimes our thinking is directed by our <a href='http://tinybuddha.com/blog/stop-beating-yourself-up-40-ways-silence-inner-critic/'>inner critic</a>, who can say some harsh things. But when you pay attention, you can recognize unhealthy thoughts and change them to more positive statements.</p> <p>My inner mean girl spoke up that night. “Tiffany counts on you to keep her safe. How could you let this happen?”</p> <p>I immediately cut this off by replacing the unhelpful thoughts with words I often say out loud to my sweet cat: “I love you, Miss Tiffany.”</p> <p>Always question your negative thoughts, and practice changing them to positive, helpful statements. Once this becomes a habit, you’ll find that negative thoughts lose their power to upset you. Over time, you will be able to more easily let them go, and your mind will become more peaceful.</p> <h4>5. Return to the present moment.</h4> <p>As human beings, one of our favorite mental activities is to get lost in thinking about the past or the future.</p> <p>Remembering to bring your attention back to “now” sweeps the debris from your mind and returns you to a state of simplicity.</p> <p>Throughout that long night, I did my best not to get lost in thoughts of how this could have happened or what Tiffany’s health would be like from then on. I just kept bringing myself back to the present moment with, “I love you, Miss Tiffany.”</p> <p>As you go about your daily activities, keep your full attention on whatever is happening here and now rather than getting lost in thought. Once this becomes a habit, you will be more connected to your inner wisdom. You will notice that decisions are easier to make, and life begins to flow more smoothly.</p> <h4>6. Trust yourself.</h4> <p>It’s better to trust in your own feelings and intuition—even if you <a href='http://tinybuddha.com/blog/how-to-grow-from-mistakes-and-stop-beating-yourself-up/'>make mistakes</a> along the way—than to look outside yourself for guidance.</p> <p>Even though this felt like an urgent crisis, I took my time considering the options.</p> <p>I could put Tiffany in the pet carrier and go for a forty-five-minute drive to the emergency veterinary hospital. Or I could quietly care for her myself for a few more hours until my local vet’s office opened.</p> <p>It was the middle of the night, and she had already been through so much. My intuition said that keeping her home would be less stressful, so that’s what we did.</p> <p>Remember to always tune in to your inner wisdom for help. Once you make this a habit, you will feel less stressed and more positive. You will have a sense of inner security and self-contained confidence that is not based on the approval of others.</p> <h4>7. Forgive.</h4> <p>True forgiveness means that you accept the reality of what happened without an emotional charge. You recognize the healing and growth you have achieved from working through the upsetting experience, and you wish healing and growth for the other person.</p> <p>My pet sitter was distraught by her scheduling mistake and begged me to forgive her. I knew she would never intentionally cause harm to any living thing. I also knew how devastated I would be if I was the one who had made such a mistake.</p> <p>And so I did. I forgave her.</p> <p>Practice forgiving others and releasing the toxic resentment that hurts your heart. Forgive yourself too; we all make mistakes at one time or another. Making a habit of forgiveness frees you to move on with your life and experience higher levels of inner peace.</p> <h3>You: Calm, Clear, and Confident</h3> <p>Life’s hard when things go wrong.</p> <p>Feeling shocked, anxious, and dejected is no fun.</p> <p>But practicing these habits when times are fairly good will enhance your life and help you stay strong during the hard times.</p> <p>Imagine being in the middle of a disappointment or a crisis and being able to move swiftly through the shock and stress rather than getting stuck there.</p> <p>Imagine feeling calm, clear, and confident during difficult circumstances instead of confused and overwhelmed.</p> <p>Imagine even reaching a state of inner peace as you take action to make things right again.</p> <p>Some of these concepts are easier to turn into habits than others, and they all take time to master.</p> <p>But if you will pick even one and start practicing, you will become stronger, wiser, and more resilient no matter what life throws at you.</p> <p>If I can do it, you can too.</p></div>",
    "category": "challenges",
    "createdBy": "662dfec99e0566e4e22e9ad7"
  },
  {
    "title": "Why Letting Ourselves Be Weak Is Actually the Key to Becoming Strong",
    "author": "Lily Velez",
    "description": "“To share your weakness is to make yourself vulnerable; to make yourself vulnerable is to show your strength.” ~Criss Jami",
    "content": "<div><p><b>“To share your weakness is to make yourself vulnerable; to make yourself vulnerable is to show your strength.” ~Criss Jami</b></p> <p>“You have to be strong.”</p> <p>Those were five words I heard without end after my father was diagnosed with stage 4 colon cancer on Black Friday 2012—a day that couldn’t have been more aptly named.</p> <p>In the months following, I marched, ran, skipped, crept, stumbled, crawled, and dragged myself through the darkest valley of my life. This was uncharted territory. This was an unprecedented season for us.</p> <p><b>My dad was a fitness junkie, running and biking every morning, performing aerobics daily like a champ, and going for the occasional swim when the mood struck. The possibility of cancer had never arrested our attention—why would it?</b></p> <p>Like so many others, I believed I’d have my dad for decades to come, that I would see his salt-and-pepper hair gradually transform to powder white as the crinkles stretching from the corner of his eyes grew in number.</p> <p>The usual questions that plague souls affected by cancer surfaced, as if some clarion call had gone out to the nether world. Questions like:</p> <p>Will the surgery be successful? (It was.) Will the oncologist order chemotherapy? (He did.)</p> <p>When will this end? When will my dad know peace and strength again? When will our lives go back to normal?</p> <p>The answers to those questions were a long time coming, until my dad was moved to ICU and put on life support in early September 2013, his organs failing.</p> <p>“Be strong,” came that ceaseless whisper. “Be strong,” well-wishers said. “Be strong. Be strong. Be strong.”</p> <p>And in the nine months leading up to that ICU transfer, I had been strong. I had remained unmoved and unaffected by any bad news, choosing to believe in a different outcome—besides, one must yet hope.</p> <p>I was like the unshakeable lighthouse tower you often see in paintings, standing tall in the midst of a tumultuous storm, gray skies, roaring waves, and angry sea breeze everywhere.</p> <p><b>Then one day, the feat of being that strong tower was simply too much to bear. I’d built a dam to keep back the emotions that threatened to overwhelm me, but that dam couldn’t possibly stand the weight of those emotions forever. It gave way.</b></p> <p>I sobbed like I’d never sobbed before in my mother’s arms. And so long as we’re being honest, I’d say I sobbed every day thereafter.</p> <p>This expression I’d so feared, this display of vulnerability I had for so long resisted and avoided, had at long last caught up with me. Yet I felt no shame or embarrassment. I felt no anger with myself or disappointment in my supposed weakness.</p> <p>Instead, I felt other things.</p> <p>Release.</p> <p>Freedom.</p> <p>Peace.</p> <p>Love.</p> <p><b>It was then that I realized that in my efforts to be strong, I had been denying myself the very feelings I’d wanted to experience all along.</b></p> <p>Too often, we build walls around ourselves in the midst of grief, pain, or challenges, inflating ourselves up to be proud people who don’t need anyone’s help, people who are getting by just fine, people who are strong enough to weather the storm on their own.</p> <p>We close ourselves off to feeling anything in the name of self-preservation. We distance ourselves from emotions that scare us because of how weak, vulnerable, incapable, or unable they may make us seem to our loved ones.</p> <p>However, it’s only through allowing ourselves to embrace that weakness and feel those daunting emotions that we invite love in to strengthen us.</p> <p><b>It’s actually a beautiful thing for someone to be weak for that reason, because in that weakness, we rely and depend on others to build us up again, to make us strong, to comfort and encourage us.</b></p> <p>An incredible bond is established between you and another person when you embrace your weakness. In that moment, transparency, honesty, and open communication win.</p> <p>Not only have you both reached a new level of personal growth and grown in your intimacy, but you’ve also given that individual an incredible gift: the opportunity to demonstrate their friendship, loyalty, and love for you by being there, by being a friend, by being present, and by enacting love.</p> <p><b>When we bottle our emotions in and suppress them, however, never letting anyone see into our soul, then we are denying others an amazing opportunity to show up for us.</b></p> <p>We are denying our relationships the opportunity to expand, evolve, and grow to a new level. And we are essentially stopping the flow of love between us and others—life-saving love that has the potential to give us more strength than we ever thought possible.</p> <p>So I made the decision to embrace my emotions and whatever weaknesses happened to visit me, to welcome the vulnerable position that would put me in.</p> <p>If someone wanted to hold me while I cried, I let them.</p> <p>If someone wanted to be a listening ear, I spoke from the depths of my heart.</p> <p>If someone wanted to take me away from the hospital scene for a good meal, I didn’t decline the invitation.</p> <p>If someone asked me how I was doing, I answered with honesty, even if it meant admitting that I was hurting and devastated.</p> <p><b>Again and again, I felt the flow of love between myself and those around me. It was uplifting and intoxicating; empowering and encouraging. It was love like I’d never seen it in action before—the type of love that can only be perfected in our very weaknesses.</b></p> <p>I had a role model throughout it all: my dad.</p> <p>I don’t even wish I could tell you he faced cancer stone-faced and unmoved by the unending dirges of prognoses.</p> <p>Instead, when the pain was too much to bear, when the figurative nights were blackest, when there seemed to be no light penetrating the all-encompassing darkness of cancer, my dad would cry, he would pray for one normal day, and he would openly talk with me about the weakness he felt.</p> <p><b>But it wasn’t weakness I saw. In those moments, when he opened himself so entirely and became vulnerable before me, I saw only strength. I saw only courage. And on the morning my dad’s heart beat for the last time, the sun laying bricks of gold across his hospital room while I held his hand in mine, I saw only inspiring beauty.</b></p> <p>Even now, as I write this, it’s with tears painting trails down my face. I embrace what we might call weakness because I know now that it’s in my weakness that I find strength. It’s in my struggle that I find determination; it’s in my challenges that I find perseverance; and it’s in my vulnerability that I find love, peace, and the will to go on.</p> <p>Have you been spending too much time hiding behind walls in an effort to be strong? Have you been distancing yourself from others, fearing they will think you weak? Have you kept your emotions at arm’s length because they intimidate you, scare you, or fill you with uncertainties?</p> <p>It’s time to give yourself permission to feel. It’s time to embrace the very vulnerability you shun and in doing so, discover the love, joy, and peace that waits for you on the other side.</p> <p>In the end, it’s through our weaknesses that we become strong again.</p> <p><i>In loving memory of my dad, ‘Bear.’ 04-01-1952 – 09-15-2013 </i></p></div>",
    "category": "challenges",
    "createdBy": "662dfec99e0566e4e22e9ad7"
  },
  {
    "title": "Dealing with Dark Days: Help for When You Don’t Feel Your Best",
    "author": "Rhiannon Laurie",
    "description": "“The problem is not that there are problems. The problem is expecting otherwise and thinking that having problems is a problem.” ~Theodore I. Rubin",
    "content": "<div><p><b>“The problem is not that there are problems. The problem is expecting otherwise and thinking that having problems is a problem.” ~Theodore I. Rubin</b><b></b></p> <p>I live in a rainy city. For most of the winter it’s endless grey, weeks in which you’re lucky to get a glimpse of the sun at all.</p> <p>It might be drizzling, it might be pouring, or it might be merely fog. It is certainly wet.</p> <p>For me and a lot of the people who live here, it’s almost a deal breaker. When I first arrived, I spent a lot of time complaining that it was raining <i>again</i>. When the sun came out, I summarily dismissed it with “yeah, but for how <i>long</i>?”</p> <p>Sometimes I still fantasize of moving somewhere nice and hot. Maybe I’ll melt all summer long, but at least there’s sun, right?</p> <p>The bottom line is that I like living here. For a thousand reasons, it’s my home. I’m not going anywhere.</p> <p>So my choice is this: embrace my decision with a full heart, rain and all, or live in bitterness, fearing the next cloud.</p> <p><i>I can’t change the weather</i>.</p> <p><b>I also live in a rainy mind. Like everyone I’ve met, I have anxieties, fears, and a thousand other difficult moods that arise in me on days when I’ve counted on sunny, focused productivity.</b></p> <p>For the last couple of years, it’s been <a title='3 Things Panic Attacks Don't Want You to Know' href='http://tinybuddha.com/blog/3-things-panic-attacks-dont-want-you-to-know/' target='_blank' rel='noopener noreferrer'>panic attacks</a>.</p> <p>Everything is going so well until something derails and my world becomes scary, my breath comes with difficulty, and I’m falling down the rabbit hole again.</p> <p>The hardest part to let go is my plans for the day. I was going to write a blog post, clean the kitchen, or go out with friends, but now I’m crouched in the corner expending all my energy to keep air pumping into and out of my lungs.</p> <p>Not fun.</p> <p>But recently I realized, <i>I can’t change the weather</i>.</p> <p>Sure, I can do things to take care of myself so panic attacks are less likely, but if it’s not one thing it’s another:</p> <p>I couldn’t sleep last night, and <a title='How to Deal with Exhaustion: 10 Tips to Function Better When You're Tired' href='http://tinybuddha.com/blog/how-to-deal-with-exhaustion-10-tips-to-function-better-when-youre-tired/' target='_blank' rel='noopener noreferrer'>now I’m tired</a>. My project isn’t coming along like I’d hoped, and now I’m cranky. The other people involved in my plans got sick, and now the plans are canceled.</p> <p>Life isn’t always sunny. <i>Life gets rainy</i>.</p> <p><b>And no, that’s not fun. Rain on a day you were hoping for sun is frustrating and sad. It can seem like everyone in the world expects constant sunny positivity from you, and when you can’t manage it, there’s shame and guilt.</b></p> <p>But it’s kind of magical when you decide to look at it like it’s largely <a title='Let Go of Control: How to Learn the Art of Surrender' href='http://tinybuddha.com/blog/let-go-of-control-how-to-learn-the-art-of-surrender/' target='_blank' rel='noopener noreferrer'>outside of your control</a>. What if today’s mini disaster blew in on the wind with the clouds? What if that same wind will blow it out again?</p> <p>Maybe today you’ll finally buy some rain boots so you can go for a walk without getting wet. Maybe today you’ll learn that the beach is different in the rain, but still kind of cool. Or you could spend today curled in a ball, cursing the grey.</p> <p>Either way, it’s still raining. Either way, you’re still lovable. You don’t have to like the weather, but it’s an option.</p> <p>And the funny thing that happens, once you stop fighting your internal weather, is it becomes calmer. It turns out that so much of the problem was the expectation that would things be different than they are, that everything would go smoothly.</p> <p>Now when it rains, I tell myself I know that I will see the sun again. It might be two weeks, but it’ll happen. Probably sooner than I think.</p> <p><b>When I feel anxiety creeping up, I remind myself that we all have emotions that are difficult for us. That I will feel calm and happy again, probably pretty soon.</b></p> <p>And then I have the space to make the best of the day I was given, not the one I ordered.</p> <p>Some thoughts that help (think of them as affirmations if you like):</p> <p><b>1. This is the weather right now.</b> I can’t change the weather, but I can take it into account to make myself more comfortable.</p> <p><b>2. The sun always comes back.</b> There are always days when things go right. This <a title='How to Deal with Uncomfortable Feelings and Create Positive Ones' href='http://tinybuddha.com/blog/how-to-deal-with-uncomfortable-feelings/' target='_blank' rel='noopener noreferrer'>discomfort</a> is temporary.</p> <p><b>3. Everyone has hard days, even if not everyone talks about them.</b> I’m still normal and lovable when my weather is rainy.</p> <p><b>4. I’m allowed to feel disappointed that things aren’t going the way I wanted.</b> I don’t have to be ready to make the best of it right away.</p> <p><b>5. What if today were supposed to be rainy?</b> What if this were exactly the right thing?</p> <p>What helps you on days when things aren’t going according to plan?</p></div>",
    "category": "challenges",
    "createdBy": "662dfec99e0566e4e22e9ad7"
  }
]
